Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: result_id is a valid resultid returned by ifx_query() or ifx_prepare() (select type queries only!).
es: result_id es un identificador válido del resultado de ifx_query() o ifx_prepare() (sólo para consultas de selección).

source: position is an optional parameter for a "fetch" operation on "scroll "cursors: "NEXT", "PREVIOUS", "CURRENT", "FIRST", "LAST" or a number.
es: position es un parámetro opcional para una operación de lectura sobre un cursor de tipo "scroll": "NEXT" (siguiente), "PREVIOUS "(anterior), "CURRENT" (actual), "FIRST "(primero), "LAST" (último) o un número.

source: If you specify a number, an "absolute" row fetch is executed.
es: Si se especifica un número, un registro concreto es leído.

source: This parameter is optional, and only valid for SCROLL cursors.
es: Este parámetro opcional es sólo válido para cursores de tipo scroll.

source: ifx_fetch_row() fetches one row of data from the result associated with the specified result identifier.
es: ifx_fetch_row() lee el contenido de un registro de la consulta representada por el identificador de resultado indicado.

source: The row is returned as an array.
es: La fila (registro) es devuelta en un array.

source: Each result column is stored in an array offset, starting at offset 0, with the column name as key.
es: Cada columna es guarda en un array, empezando éste desde cero.

source: Subsequent calls to ifx_fetch_row() would return the next row in the result set, or FALSE if there are no more rows.
es: Las llamadas posteriores a ifx_fetch_row() devolverán el registro siguiente en el resultado de la consulta, o FALSE si no hay más filas.

source: Informix fetch rows
es: Leer registros

source: $rid = ifx_prepare ("select * from emp where name like ". $name, $connid, IFX_SCROLL); if (! $rid) {... error...} $rowcount = ifx_affected_rows($rid); if ($rowcount 1000) {printf ("Too many rows in result set (%d)\n br", $rowcount); die ("Please restrict your query br \n");} if (! ifx_do ($rid)) {... error...} $row = ifx_fetch_row ($rid, "NEXT"); while (is_array($row)) {for(reset($row); $fieldname=key($row); next($row)) {$fieldvalue = $row[$fieldname]; printf ("%s = %s ,", $fieldname, $fieldvalue);} printf("\n br "); $row = ifx_fetch_row ($rid, "NEXT");} ifx_free_result ($rid);
es: $rid = ifx_prepare ("select * from emp where name like ". $name, $connid, IFX_SCROLL); if (! $rid) {... error...} $rowcount = ifx_affected_rows($rid); if ($rowcount 1000) {printf ("Too many rows in result set (%d)\n br", $rowcount); / / Demasiados registros en el resultado die ("Please restrict your query br \n"); / / Por favor, restringe tu consulta} if (! ifx_do ($rid)) {... error...} $row = ifx_fetch_row ($rid, "NEXT"); while (is_array($row)) {for(reset($row); $fieldname=key($row); next($row)) {$fieldvalue = $row[$fieldname]; printf ("%s = %s ,", $fieldname, $fieldvalue);} printf("\n br "); $row = ifx_fetch_row ($rid, "NEXT");} ifx_free_result ($rid);

source: Returns an associative array with fieldnames as key and the SQL fieldproperties as data for a query with result_id.
es: Dada una consulta representada por result_id devuelve un array con los nombres de campo como llaves y las propiedades como datos.

source: Returns the Informix SQL fieldproperties of every field in the query as an associative array.
es: Devuelve las propiedades SQL de cada campo como un array.

source: Properties are encoded as: "SQLTYPE;length;precision;scale;ISNULLABLE" where SQLTYPE = the Informix type like "SQLVCHAR "etc. and ISNULLABLE = "Y" or "N ".
es: Las propiedades son codificadas así: "SQLTYPE;longitud;precisión;escala;ISNULLABLE" siendo SQLTYPE el tipo de dato definido en Informix como puede ser "SQLVCHAR "etc. e ISNULLABLE (puede ser nulo) igual a "Y" sí o "N "no.

source: Informix SQL fieldproperties
es: Propiedades de los campos de una consulta SQL

source: $properties = ifx_fieldproperties ($resultid); if (! isset($properties)) {... error...} for ($i = 0; $i count($properties); $i++) {$fname = key ($properties); printf ("%s:\t type = %s\n", $fname, $properties[$fname]); next ($properties);}
es: $properties = ifx_fieldtypes ($resultid); if (! isset($properties)) {... error...} for ($i = 0; $i count($properties); $i++) {$fname = key ($properties); printf ("%s:\t type = %s\n", $fname, $properties[$fname]); next ($properties);}

source: Returns an associative array with fieldnames as key and the SQL fieldtypes as data for query with result_id.
es: Dada una consulta representada por result_id devuelve un array con los nombres de campo como llaves y los tipos como datos.

source: Fieldnames and SQL fieldtypes
es: Nombres y tipos de campos de una consulta SQL

source: Deletes the blobobject for the given blob object-id bid.
es: Elimina el objeto blob representado por el identificador bid.

source: Deletes the charobject for the given char object-id bid.
es: Borra el objeto char representado por el identificador del char bid.

source: Releases resources for the query associated with result_id.
es: Libera los recursos representados por el identificador result_id de una consulta.

source: Returns the content of the blob object for the given blob object-id bid.
es: Devuelve el contenido de un objeto blob representado por su identificador bid.

source: Returns the content of the char object for the given char object-id bid.
es: Devuelve el contenido de un objeto char representado por su identificador bid.

source: Returns a pseudo-row (associative array) with sqlca.sqlerrd[0]... sqlca.sqlerrd[5] after the query associated with result_id.
es: Devuelve una seudo fila (array asociativo) con los valores de sqlca.sqlerrd[0] a sqlca.sqlerrd[5] de una consulta ejecutada, representada ésta con un identificador de resultado result_id.

source: For inserts, updates and deletes the values returned are those as set by the server after executing the query.
es: Para inserciones, actualizaciones y borrados los valores devueltos son aquellos definidos por el servidor después de que la consulta sea ejecutada.

source: This gives access to the number of affected rows and the serial insert value.
es: Esto da acceso al número de registros procesados y al valor de una columna de tipo serial en una consulta de inserción.

source: For SELECTs the values are those saved after the PREPARE statement.
es: Para consultas de selección, los valores son guardados cuando se prepara la sentencia.

source: This gives access to the *estimated* number of affected rows.
es: También permite conocer el número estimado de registros procesados.

source: The use of this function saves the overhead of executing a "select dbinfo('sqlca.sqlerrdx')" query, as it retrieves the values that were saved by the ifx driver at the appropriate moment.
es: El uso de esta función evita el sobrecoste de ejecutar la consulta "select dbinfo('sqlca.sqlerrdx')", como obtener los valores guardados por el conector para Informix en el momento apropiado.

source: Retrieve Informix sqlca.sqlerrd[ x] values
es: Obtener los valores sqlca.sqlerrd[ x]

source: /* assume the first column of 'sometable' is a serial * / $qid = ifx_query("insert into sometable values (0, '2nd column', 'another column') ", $connid); if (! $qid) {... error...} $sqlca = ifx_getsqlca ($qid); $serial_value = $sqlca["sqlerrd1"]; echo "The serial value of the inserted row is:". $serial_value br \n";
es: /* suponiendo que la primera columna de la tabla 'sometable' es de tipo serial * / $qid = ifx_query("insert into sometable values(0, '2nd column', 'another column '", $connid); if (! $qid) {... error...} $sqlca = ifx_getsqlca ($qid); $serial_value = $sqlca["sqlerrd1"]; echo "The serial value of the inserted row is:". $serial_value br \n"; / / El valor de tipo serial del registro insertado es:

source: Returns the number of rows fetched or FALSE on error.
es: Devuelve el número de registros leídos o FALSE si hubo error.

source: Formats all rows of the result_id query into a html table.
es: Muestra todas las filas de la consulta result_id dentro de una tabla html.

source: The optional second argument is a string of table tag options
es: El argumento segundo, opcional, es una cadena de parámetros del tag table

source: Informix results as HTML table
es: Mostrar resultado como una tabla HTML

source: $rid = ifx_prepare ("select * from emp where name like ". $name, $connid, IFX_SCROLL); if (! $rid) {... error...} $rowcount = ifx_affected_rows ($rid); if ($rowcount 1000) {printf ("Too many rows in result set (%d)\n br", $rowcount); die ("Please restrict your query br \n");} if (! ifx_do($rid) {... error...} ifx_htmltbl_result ($rid, "border=\"2\""); ifx_free_result($rid);
es: $rid = ifx_prepare ("select * from emp where name like ". $name, $connid, IFX_SCROLL); if (! $rid) {... error...} $rowcount = ifx_affected_rows ($rid); if ($rowcount 1000) {printf ("Too many rows in result set (%d)\n br", $rowcount); / / Demasiados registros en el resultado die ("Please restrict your query br \n"); / / Por favor, restringe tu consulta} if (! ifx_do($rid) {... error...} ifx_htmltbl_result ($rid, "border=\"2\""); ifx_free_result($rid);

source: Sets the default return value of a NULL-value on a fetch row.
es: Define el valor por defecto cuando se leen valores nulos.

source: Mode "0" returns "", and mode "1 "returns" NULL ".
es: Modo (mode) "0 "devuelve "", y modo "1" devuelve "NULL".

source: Returns the number of columns in query for result_id or FALSE on error
es: Dada una consulta representada por result_id devuelve el número de columnas o FALSE si se produjo un error.

source: After preparing or executing a query, this call gives you the number of columns in the query.
es: Después de preparar o ejecutar una consulta, una llamada a esta función te da el número de columnas en la consulta.

source: Gives the number of rows fetched so far for a query with result_id after a ifx_query() or ifx_do() query.
es: Da el número de registros ya leídos de una consulta representada por un result_id después de llamar a ifx_query() o ifx_do().

source: A positive Informix persistent link identifier on success, or FALSE on error
es: Devuelve un identificador positivo de enlace persistente si hubo conexión, o FALSE si se produjo un error.

source: ifx_pconnect() acts very much like ifx_connect() with two major differences.
es: ifx_pconnect() actúa muy parecido a ifx_connect() con dos principales diferencias.

source: This function behaves exactly like ifx_connect() when PHP is not running as an Apache module.
es: Esta función se comporta exactamente igual que ifx_connect() cuando PHP no es ejecutado como un módulo de Apache.

source: First, when connecting, the function would first try to find a (persistent) link that's already open with the same host, username and password.
es: La primera diferencia es cuando se conecta, la función intentará encontrar un enlace (persistente) que exista con el mismo servidor, usuario y contraseña.

source: If one is found, an identifier for it will be returned instead of opening a new connection.
es: Si es hallado, el identificador del enlace será devuelto en vez de abrir una nueva conexión.

source: Second, the connection to the SQL server will not be closed when the execution of the script ends.
es: Segundo, la conexión al servidor no se cerrará cuando la ejecución del guión (script) finalice.

source: Instead, the link will remain open for future use (ifx_close() will not close links established by ifx_pconnect()).
es: En vez de esto, la conexión permanecerá abierta para usos futuros (ifx_close() no cerrará el enlace creado por ifx_pconnect()).

source: This type of links is therefore called 'persistent'.
es: Este tipo de enlace es, por tanto, llamado 'persistente'

source: See also: ifx_connect().
es: Examina también: ifx_connect().

source: Returns a integer result_id for use by ifx_do().
es: Devuelve un entero (integer) result_id para usarlo con ifx_do().

source: Sets affected_rows for retrieval by the ifx_affected_rows() function.
es: Es definido "affected_rows" (registros procesados) y se puede obtener mediante la función ifx_affected_rows().

source: Prepares query on connection conn_id.
es: Prepara una consulta (query) sobre una conexión (link_identifier).

source: For "select-type" queries a cursor is declared and opened.
es: Un cursor es definido y abierto para las consultas de selección.

source: The optional cursor_type The optional cursor_type parameter allows you to make this a "scroll" and / or "hold "cursor.
es: El parámetro opcional tipo de cursor (cursor_type) te permite que sea un cursor de tipo "scroll "y / o "hold".

source: It' s a bitmask and can be either IFX_SCROLL, IFX_HOLD, or both or'ed together.
es: Es una máscara y puede ser IFX_SCROLL, IFX_HOLD o ambos.

source: For either query type the estimated number of affected rows is saved for retrieval by ifx_affected_rows().
es: Para cualquier tipo de consulta el número estimado de registros afectados (procesados) es guardado y puede ser obtenido mediante ifx_affected_rows().

source: If you have BLOB (BYTE or TEXT) columns in the query, you can add a blobidarray parameter containing the corresponding "blob ids", and you should replace those columns with a "?" in the query text.
es: Si tienes columnas BLOB (BYTE o TEXT) en una consulta, puedes añadir un parámetro blobidarray conteniendo los identificadores de blob y sustituir los valores de esas columnas por una "?" en el texto de la consulta.

source: If the contents of the TEXT (or BYTE) column allow it, you can also use "ifx_textasvarchar(1) "and "ifx_byteasvarchar(1)".
es: Si el contenido de la columna de tipo TEXT (o BYTE) lo permite, puedes también usar "ifx_textasvarchar(1) "y "ifx_byteasvarchar(1)".

source: This allows you to treat TEXT (or BYTE) columns just as if they were ordinary (but long) VARCHAR columns for select queries, and you don't need to bother with blob id's.
es: Esto supone manejar columnas de tipo TEXT (o BYTE) como si fueran columnas normales de tipo VARCHAR (pero teniendo en cuenta que tendrán un mayor tamaño que el habitual), para consultas de selección y no necesitas preocuparte por los identificadores de blob.

source: With ifx_textasvarchar( 0) or ifx_byteasvarchar(0) (the default situation), select queries will return BLOB columns as blob id's (integer value).
es: La opción por defecto ifx_textasvarchar( 0) o ifx_byteasvarchar(0) devuelve identificadores de blob (valores enteros) para las consultas de selección.

source: You can get the value of the blob as a string or file with the blob functions (see below).
es: Puedes obtener el contenido del blob como una cadena o un fichero con las funciones para blob (ver más adelante).

source: See also: ifx_do().
es: Examina también: ifx_do().

source: A positive Informix result identifier on success, or FALSE on error.
es: Devuelve un identificador positivo de resultado si tuvo éxito, FALSE en otro caso.

source: A "result_id" resource used by other functions to retrieve the query results.
es: Un entero (integer) "result_id "usado por otras funciones para obtener el resultado de la consulta.

source: Sets "affected_rows" for retrieval by the ifx_affected_rows() function.
es: Es definido "affected_rows" (registros procesados) y se puede obtener mediante la función ifx_affected_rows().

source: ifx_query() sends a query to the currently active database on the server that's associated with the specified link identifier.
es: Si el identificador no es definido, el último enlace abierto es asumido.

source: Non-select queries are "execute immediate".
es: El parámetro opcional tipo de cursor (cursor_type) te permite que sea un cursor de tipo "scroll "y / o "hold".

source: IFX_SCROLL and IFX_HOLD are symbolic constants and as such shouldn 't be between quotes.
es: Es una máscara y puede ser IFX_SCROLL, IFX_HOLD o ambos.

source: I you omit this parameter the cursor is a normal sequential cursor.
es: Las consultas que no son de selección son ejecutadas inmediatamente.

source: For either query type the number of (estimated or real) affected rows is saved for retrieval by ifx_affected_rows().
es: Para cualquier tipo de consulta el número (estimado o real) de registros procesados es guardo y se puede obtener mediante ifx_affected_rows().

source: If you have BLOB (BYTE or TEXT) columns in an update query, you can add a blobidarray parameter containing the corresponding "blob ids", and you should replace those columns with a "?" in the query text.
es: Si tienes columnas BLOB (BYTE o TEXT) en una consulta de actualización, puedes añadir un parámetro blobidarray conteniendo los identificadores de blob y sustituir los valores de esas columnas por una "?" en el texto de la consulta.

source: Show all rows of the "orders" table as a html table
es: Mostrar todos los registros de la tabla "orders" como una tabla html

source: ifx_textasvarchar( 1); / / use "text mode "for blobs $res_id = ifx_query("select * from orders", $conn_id); if (! $res_id) {printf("Can't select orders: %s\n br %s br \n", ifx_error()); ifx_errormsg(); die;} ifx_htmltbl_result($res_id, "border=\"1\""); ifx_free_result($res_id);
es: ifx_textasvarchar( 1); / / usa "modo texto "para blobs $res_id = ifx_query("select * from orders", $conn_id); if (! $res_id) {printf("Can't select orders: %s\n br %s br \n", ifx_error()); ifx_errormsg(); die;} ifx_htmltbl_result($res_id, "border=\"1\""); ifx_free_result($res_id);

source: Insert some values into the "catalog" table
es: Inserta valores en la tabla "catalog"

source: / / create blob id' s for a byte and text column $textid = ifx_create_blob(0, 0, "Text column in memory"); $byteid = ifx_create_blob(1, 0, "Byte column in memory"); / / store blob id's in a blobid array $blobidarray[] = $textid; $blobidarray[] = $byteid; / / launch query $query = "insert into catalog (stock_num, manu_code, ". "cat_descr,cat_picture) values(1 ,'HRO',?, ?)"; $res_id = ifx_query($query, $conn_id, $blobidarray); if (! $res_id) {... error...} / / free result id ifx_free_result($res_id);
es: / / crea identificadores de blob para una columna de tipo byte y otra text $textid = ifx_create_blob( 0, 0, "Text column in memory"); $byteid = ifx_create_blob(1, 0, "Byte column in memory"); / / almacena los identificadores de blob en un array llamado blobid $blobidarray[] = $textid; $blobidarray[] = $byteid; / / lanza la consulta $query = "insert into catalog (stock_num, manu_code, ". "cat_descr,cat_picture) values(1 ,'HRO',?, ?)"; $res_id = ifx_query($query, $conn_id, $blobidarray); if (! $res_id) {... error...} / / libera el resultado ifx_free_result($res_id);

source: Sets the default text mode for all select-queries.
es: Define el modo por defecto para los campos de tipo text en todas las consultas de selección.

source: Updates the content of the blob object for the given blob object bid. content is a string with new data.
es: Actualiza el contenido de un objeto blob representado por su identificador bid. content es una cadena con el nuevo contenido.

source: Updates the content of the char object for the given char object bid. content is a string with new data.
es: Actualiza el contenido de un objeto char representado por su identificador bid. content es una cadena con la información nueva.

source: Deletes the slob object on the given slob object-id bid.
es: Cierra un objeto slob representado por su identificador de slob bid.

source: Creates an slob object and opens it.
es: Crea un objeto slob y lo abre.

source: Modes:
es: Modos:

source: 1 = LO_RDONLY, 2 = LO_WRONLY, 4 = LO_APPEND, 8 = LO_RDWR, 16 = LO_BUFFER, 32 = LO_NOBUFFER - or-mask.
es: 1 = LO_RDONLY, 2 = LO_WRONLY, 4 = LO_APPEND, 8 = LO_RDWR, 16 = LO_BUFFER, 32 = LO_NOBUFFER o una combinación de ellos.

source: You can also use constants named IFX_LO_RDONLY, IFX_LO_WRONLY etc.
es: También puedes usar nombres de constantes IFX_LO_RDONLY, IFX_LO_WRONLY, etc.

source: Return FALSE on error otherwise the new slob object-id.
es: Devuelve FALSE si hubo error, en otro caso el identificador del nuevo objeto slob.

source: ifxus_free_slob
es: ifx_free_slob

source: (PHP 3 = 3.0.4, PHP 4)
es: (no version information, might be only in CVS)

source: Deletes the slob object. bid is the Id of the slob object.
es: Borra un objeto slob. bid es el identificador del objeto slob.

source: Opens an slob object. bid should be an existing slob id.
es: Abre un objeto slob. bid será un identificador de slob que válido.

source: Returns FALSE on error otherwise the new slob object-id.
es: Devuelve FALSE si hubo error, en otro caso el identificador del nuevo objeto slob.

source: Reads nbytes of the slob object. bid is a existing slob id and nbytes is the number of bytes read.
es: Lee un número de bytes (nbytes) de un objeto slob. bid es un identificador de slob válido y nbytes es el número de bytes a leer.

source: Return FALSE on error otherwise the string.
es: Devuelve FALSE si hubo error, sino la cadena.

source: Sets the current file or seek position of an open slob object. bid should be an existing slob id.
es: Define el fichero o posición en memoria de un objeto slob abierto, bid será un identificador de slob válido.

source: 0 = LO_SEEK_SET, 1 = LO_SEEK_CUR, 2 = LO_SEEK_END and offset is an byte offset.
es: 0 = LO_SEEK_SET, 1 = LO_SEEK_CUR, 2 = LO_SEEK_END y offset es el desplazamiento en bytes.

source: Return FALSE on error otherwise the seek position.
es: Si hubo error entonces da FALSE.

source: Returns the current file or seek position of an open slob object bid should be an existing slob id.
es: Devuelve el fichero actual o la posición en memoria de un objeto slob abierto, bid Devuelve el fichero actual o la posición en memoria de un objeto slob abierto, bid será un identificador de slob válido.

source: Writes a string into the slob object. bid is a existing slob id and content the content to write.
es: Escribe una cadena en un objeto slob. bid es un identificador de slob válido y content el contenido a escribir.

source: Return FALSE on error otherwise bytes written.
es: Devuelve FALSE si hubo error, sino el número de bytes escritos.

source: InterBase functions
es: Funciones InterBase

source: This function sets whether a client disconnect should cause a script to be aborted.
es: Esta función establece si la desconexión de un cliente debe provocar la suspensión del script.

source: It will return the previous setting and can be called without an argument to not change the current setting and only return the current setting.
es: Devolverá el valor previo y puede ser llamada sin argumentos para devolver el valor actual y no cambiarlo.

source: See the Connection Handling section in the Features chapter for a complete description of connection handling in PHP.
es: Véase la sección sobre la Gestión de la Conexión en el capítulo Características para una descripción completa de la gestión de la conexión en PHP.

source: 0° is located at the three-o 'clock position, and the arc is drawn counter-clockwise.
es: ImageArc dibuja una elipse parcial centrada en cx, cy (la esquina superior izquierda es 0,0) en la imagen que representa im. w y h especifican la anchura y altura respectivamente mientras que los puntos de inicio y final vienen indicados por los parámetros s y e en grados.

source: imagechar() draws the first character of c in the image identified by id with its upper-left at x, y (top left is 0, 0) with the color col.
es: ImageChar dibuja el primer carácter de c en la imagen identificada como id con su esquina superior izquierda en x, y (arriba izquierda es 0,0) con el color col.

source: If font is 1, 2, 3, 4 or 5, a built-in font is used (with higher numbers corresponding to larger fonts).
es: Si la fuente es 1, 2, 3, 4 o 5 se usa una fuente predefinida (números mayores corresponden con tamaños mayores).

source: See also imageloadfont().
es: Vea también imageloadfont().
